Revit 2027 API
BuiltInFailures.GeometryFailures.FailToConvertLine Property
 Unable to convert lines
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FailToConvertLine { get; }
Public Shared ReadOnly Property FailToConvertLine As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FailToConvertLine {
	FailureDefinitionId^ get ();
}
static member FailToConvertLine : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeometryFailures Class
Autodesk.Revit.DB Namespace